twoPhaseStratifiedFlow/meshB/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //




//dummy z direction
 
 

 //inlet
 //L outlet

 //d
 //H





// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    (0 10.0 0)
    (10.0 10.0 0)
    (10.0 20.0 0)
    (0 20.0 0)
    (0 10.0 0.00001)
    (10.0 10.0 0.00001)
    (10.0 20.0 0.00001)
    (0 20.0 0.00001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 25 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    empty backFront
    (
        (4 5 6 7)
        (0 3 2 1) 
    )
    wall inlet
    (
        (0 4 7 3)
    )
    wall outlet
    (
        (2 6 5 1)
    )
    wall Wall
    (
        (3 7 6 2)
    )
    wall interfaceShadow
    (
        (0 1 5 4)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
